# определение сезона по порядковому номеру месяца

month_number =  int(input("Введите порядковый номер месяца: "))

#проверка правильности ввода не меньше 0 и не больше 12
is_enable_month = False
if month_number > 12 or month_number < 1:
    while not is_enable_month:
        if month_number > 12 or month_number < 1:
            print("\033[91m")
            print("\tОшибка ввода, попробуйте ещё раз!")
            print("\033[0m")
            month_number = int(input("Введите порядковый номер месяца: "))
        else:
            is_enable_month = True

month_dict = {
     12: ("Декабрь","Зима")
    , 1: ("Январь", "Зима")
    , 2: ("Февраль","Зима")
    , 3: ("Март",   "Весна")
    , 4: ("Апрель", "Весна")
    , 5: ("Май",    "Весна")
    , 6: ("Июнь",   "Лето")
    , 7: ("Июль",   "Лето")
    , 8: ("Август", "Лето")
    , 9: ("Сентябрь","Осень")
    , 10:("Октябрь", "Осень")
    , 11:("Ноябрь",  "Осень")
}
month_list = [
     ("Январь", "Зима"),("Февраль","Зима"),("Март",   "Весна")
    ,("Апрель", "Весна"),("Май",    "Весна"),("Июнь",   "Лето")
    ,("Июль",   "Лето"),("Август", "Лето"),("Сентябрь","Осень")
    ,("Октябрь", "Осень"),("Ноябрь",  "Осень"),("Декабрь","Зима")
]

print(f"(Dict Data) Месяц: {month_dict[month_number][0]}, Cезон: {month_dict[month_number][1]}")
print(f"(List Data) Месяц: {month_list[month_number-1][0]}, Cезон: {month_list[month_number-1][1]}")